Ran Plan for dir: `terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_route53_zone.main has changed
~ resource "aws_route53_zone" "main" {
        id            = "Z0975097GI60AUOWBH82"
        name          = "findafoodtruck.ga"
      + tags          = {}
        # (6 unchanged attributes hidden)
    }

  # aws_s3_bucket.s3-home has changed
~ resource "aws_s3_bucket" "s3-home" {
        id                          = "terraform-20220123171338585400000002"
      + tags                        = {}
        # (12 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # aws_s3_bucket.s3_home will be destroyed
  # (because aws_s3_bucket.s3_home is not in configuration)
- resource "aws_s3_bucket" "s3_home" {
      - acl                         = "public-read" -> null
      - arn                         = "arn:aws:s3:::terraform-20220121192859548500000001" -> null
      - bucket                      = "terraform-20220121192859548500000001" -> null
      - bucket_domain_name          = "terraform-20220121192859548500000001.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "terraform-20220121192859548500000001.s3.us-east-2.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z2O1EMRO9K5GLX" -> null
      - id                          = "terraform-20220121192859548500000001" -> null
      - region                      = "us-east-2" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
      - website_domain              = "s3-website.us-east-2.amazonaws.com" -> null
      - website_endpoint            = "terraform-20220121192859548500000001.s3-website.us-east-2.amazonaws.com" -> null

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      - website {
          - error_document = "error.html" -> null
          - index_document = "index.html" -> null
        }
    }

  # aws_s3_bucket_policy.public-read will be created
+ resource "aws_s3_bucket_policy" "public-read" {
      + bucket = "terraform-20220123171338585400000002"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObjectVersion",
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::terraform-20220123171338585400000002/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::246850902828:user/github-actions"
                        }
                      + Resource  = "arn:aws:s3:::terraform-20220123171338585400000002/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # github_actions_secret.S3_BUCKET will be created
+ resource "github_actions_secret" "S3_BUCKET" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "foodtrucks"
      + secret_name     = "S3_BUCKET"
      + updated_at      = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.greenatlantis.ga/lock?id=marknooch%252Ffoodtrucks%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 2 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
